title: week 9 assignment sigma rule
status: test
description: Detects when the bitsadmin process is run with an unusual parent
references:
   - https://github.com/EvaStanAccount/IT4077/blob/Main/Week10.ps1
author: Nick Blank 
date: 2024-10-31
logsource:
  category: process_creation
  product: windows
detection:
    parent_process:
        winlog.event_data.ParentImage|contains: '\\powershell.exe'
    selection_img:
        winlog.event_data.Image|endswith: '\\bitsadmin.exe'
        winlog.event_data.OriginalFileName: 'bitsadmin.exe'
    selection_cmd:
        winlog.event_data.CommandLine|contains: ' /transfer '
    selection_cli_1:
        winlog.event_data.CommandLine|contains:
            - ' /create '
            - ' /addfile '
    selection_cli_2:
        winlog.event_data.CommandLine|contains: 'http'
    condition: selection_img and (selection_cmd or (selection_cli_1 and selection_cli_2)) and parent_process
fields:
    - winlog.event_data.CommandLine
    - winlog.event_data.ParentCommandLine
    - winlog.event_data.ParentImage
falsepositives:
    - Some legitimate apps may use bitsadmin
level: medium
